Долома/src/Documents/ИзменениеКлички/ИзменениеКлички.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеКлички</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Животные</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>СтараяКличка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяКличка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Долома/src/Documents/ИзменениеКлички/Forms/ФормаДокумента/Module.bsl
#Region ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
		Объект.Ферма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Автор, "ОсновнаяФерма");
		
        Если Параметры.Свойство("МассивЖивотных") Тогда
			Для Каждого СсылкаЖивотного Из Параметры.МассивЖивотных Цикл
				НоваяСтрока = Объект.Животные.Добавить();
				НоваяСтрока.Животное = СсылкаЖивотного;
				НоваяСтрока.СтараяКличка = СсылкаЖивотного.Наименование;
			КонецЦикла;
        КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТолькоПросмотр = ОграничениеДоступности.ОграничитьДанныеДокумента(Объект.Дата);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТекущиеДанные = Элементы.Животные.ТекущиеДанные;
	ТекущиеДанные.Животное = ВыбранноеЗначение;
	ЖивотноеПриИзменении();
	
КонецПроцедуры

#EndRegion

#Region ОбработчикиСобытийЭлементовТаблицыФормыЖивотные

&НаКлиенте
Процедура ЖивотныеЖивотноеПриИзменении(Элемент)
	ЖивотноеПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ЖивотныеЖивотноеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) 
	
	Если Объект.Ферма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокПараметров = Новый Массив;
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", ДанныеЖивотных.ПолучитьСписокЖивотныхПоФермеДокумента(Объект.Ферма, Объект.Дата));
	СписокПараметров.Добавить(ПараметрВыбора);
	ФиксированныеПараметры = Новый ФиксированныйМассив(СписокПараметров);
	
	Элемент.ПараметрыВыбора = ФиксированныеПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖивотныеЖивотноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Ферма", Объект.Ферма);
	
	ВзаимодействиеКлиент.ОткрытьФормуВыбораЖивотного(ЭтаФорма, СписокПараметров);
	
КонецПроцедуры

#EndRegion

#Region СлужебныеПроцедурыИФункции

// Вспомогательные процедуры и функции для работы с формой
&НаКлиенте
Процедура ЖивотноеПриИзменении()
	
	ТекущаяСтрока = Элементы.Животные.ТекущиеДанные;
	ТекущаяСтрока.СтараяКличка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Животное, "Кличка");
	
КонецПроцедуры

#EndRegion
